import { TSubjectId, TSubjectObj } from "@types"

export const SubjectIDs: TSubjectId[] = [
  "GAT",
  "PAT1",
  "PAT2",
  "PAT3",
  "PAT4",
  "PAT5",
  "PAT6",
  "PAT7",
  "GEN69",
  "GEN49",
  "GEN99",
  "GEN09",
  "GEN19",
  "GEN39",
  "GEN89",
  "GEN29",
  "GEN59",
  "MED1",
  "MED2",
  "MED3",
]

export const GatPatSubjectIds: TSubjectId[] = ["GAT", "PAT1", "PAT2", "PAT3", "PAT4", "PAT5", "PAT6", "PAT7"]

export const MedSubjectIds: TSubjectId[] = [
  "GEN69",
  "GEN49",
  "GEN99",
  "GEN09",
  "GEN19",
  "GEN39",
  "GEN89",
  "GEN29",
  "GEN59",
  "MED1",
  "MED2",
  "MED3",
]

export const SubjectMap: Record<TSubjectId, TSubjectObj> = {
  /* GAT/PAT */
  GAT: { date: "03/12", from: "08.30", to: "11.30", text: "GAT ความถนัดทั่วไป" },
  PAT1: { date: "03/12", from: "13.00", to: "16.00", text: "PAT 1 ความถนัดทางคณิตศาสตร์" },
  PAT2: { date: "03/13", from: "08.30", to: "11.30", text: "PAT 2 ความถนัดทางวิทยาศาสตร์" },
  PAT3: { date: "03/14", from: "08.30", to: "11.30", text: "PAT 3 ความถนัดทางวิศวกรรมศาสตร์" },
  PAT4: { date: "03/14", from: "13.00", to: "16.00", text: "PAT 4 ความถนัดทางสถาปัตยกรรมศาสตร์" },
  PAT5: { date: "03/13", from: "13.00", to: "16.00", text: "PAT 5 ความถนัดทางวิชาชีพครู" },
  PAT6: { date: "03/15", from: "08.30", to: "11.30", text: "PAT 6 ความถนัดทางศิลกรรมศาสตร์" },
  PAT7: { date: "03/15", from: "13.00", to: "16.00", text: "PAT 7 ความถนัดทางภาษา" },
  /* วิชาสามัญ */
  GEN69: { date: "03/19", from: "08.30", to: "10.00", text: "วิชาสามัญ ชีววิทยา" },
  /* - same */
  GEN49: { date: "03/19", from: "11.00", to: "12.00", text: "วิชาสามัญ ฟิสิกส์" },
  GEN99: { date: "03/19", from: "11.00", to: "12.00", text: "วิชาสามัญ วิทยาศาสตร์" },
  /* - /same */
  GEN09: { date: "03/19", from: "13.00", to: "15.00", text: "วิชาสามัญ ภาษาไทย" },
  GEN19: { date: "03/19", from: "15.30", to: "17.00", text: "วิชาสามัญ สังคมศึกษา" },
  /* - same */
  GEN39: { date: "03/20", from: "08.30", to: "10.00", text: "วิชาสามัญ คณิตศาสตร์ 1" },
  GEN89: { date: "03/20", from: "08.30", to: "10.00", text: "วิชาสามัญ คณิตศาสตร์ 2" },
  /* - /same */
  GEN29: { date: "03/20", from: "11.00", to: "12.30", text: "วิชาสามัญ ภาษาอังกฤษ" },
  GEN59: { date: "03/20", from: "13.30", to: "15.00", text: "วิชาสามัญ เคมี" },
  /* กสพท. */
  MED1: { date: "03/26", from: "08.30", to: "09.45", text: "วิชาเฉพาะแพทย์ฉบับที่ 1 (เชาวน์ปัญญา)" },
  MED2: { date: "03/26", from: "09.55", to: "10.55", text: "วิชาเฉพาะแพทย์ฉบับที่ 2 (จริยธรรมทางการแพทย์)" },
  MED3: { date: "03/26", from: "11.30", to: "12.30", text: "วิชาเฉพาะแพทย์ฉบับที่ 3 (ความคิดเชื่อมโยง)" },
}

export const SubjectNames: Record<TSubjectId, string> = {
  GAT: "GAT ความถนัดทั่วไป",
  PAT1: "PAT 1 ความถนัดทางคณิตศาสตร์",
  PAT2: "PAT 2 ความถนัดทางวิทยาศาสตร์",
  PAT3: "PAT 3 ความถนัดทางวิศวกรรมศาสตร์",
  PAT4: "PAT 4 ความถนัดทางสถาปัตยกรรมศาสตร์",
  PAT5: "PAT 5 ความถนัดทางวิชาชีพครู",
  PAT6: "PAT 6 ความถนัดทางศิลกรรมศาสตร์",
  PAT7: "PAT 7 ความถนัดทางภาษา",
  GEN69: "69 วิชาสามัญ ชีววิทยา",
  GEN49: "49 วิชาสามัญ ฟิสิกส์",
  GEN99: "99 วิชาสามัญ วิทยาศาสตร์",
  GEN09: "09 วิชาสามัญ ภาษาไทย",
  GEN19: "19 วิชาสามัญ สังคมศึกษา",
  GEN39: "39 วิชาสามัญ คณิตศาสตร์ 1",
  GEN89: "89 วิชาสามัญ คณิตศาสตร์ 2",
  GEN29: "29 วิชาสามัญ ภาษาอังกฤษ",
  GEN59: "59 วิชาสามัญ เคมี",
  MED1: "วิชาเฉพาะแพทย์ฉบับที่ 1 (เชาวน์ปัญญา)",
  MED2: "วิชาเฉพาะแพทย์ฉบับที่ 2 (จริยธรรมทางการแพทย์)",
  MED3: "วิชาเฉพาะแพทย์ฉบับที่ 3 (ความคิดเชื่อมโยง)",
}

// export const TimeSchedule = {
//   "03/12": [
//     ["GAT", "08.30", "11.30"],
//     ["PAT1", "13.00", "16.00"],
//   ],
//   "03/13": [
//     ["PAT2", "08.30", "11.30"],
//     ["PAT5", "13.00", "16.00"],
//   ],
//   "03/14": [
//     ["PAT3", "08.30", "11.30"],
//     ["PAT4", "13.00", "16.00"],
//   ],
//   "03/15": [
//     ["PAT6", "08.30", "11.30"],
//     ["PAT7", "13.00", "16.00"],
//   ],
//   "03/19": [
//     ["GEN69", "08.30", "10.00"],
//     ["GEN49|99", "11.00", "12.00"],
//     ["GEN09", "13.00", "15.00"],
//     ["GEN19", "15.30", "17.00"],
//   ],
//   "03/20": [
//     ["GEN39|89", "08.30", "10.00"],
//     ["GEN29", "11.00", "12.30"],
//     ["GEN59", "13.30", "15.00"],
//   ],
//   "03/26": [
//     ["MED1", "08.30", "09.45"],
//     ["MED2", "09.55", "10.55"],
//     ["MED3", "11.30", "12.30"],
//   ],
// }
